<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Nats queue-group-name
    |--------------------------------------------------------------------------
    |
    | 一个QueueGroupName对应的一个服务多个负载，保证一个消息只会被一个负载消费
    | 不同服务的QueueGroupName必须不同
    |
    */
    'nats'  => [
        'queue_group_name'  => env('APP_NAME', ''),
    ],

    /*
    |--------------------------------------------------------------------------
    | Message subscribe subjects
    |--------------------------------------------------------------------------
    |
    | 消息订阅列表（需映射到回调执行类）
    | 所有需要启动的订阅类，需继承 Voilaf\MessageSystem\Contracts\Subscribe 接口类
    |
     */
    'sub_subjects' => [
        // 'lanqb_user_register'   => \App\Sub\LanqbUserRegister::class,
    ],

    /*
    |--------------------------------------------------------------------------
    | Message publish subjects
    |--------------------------------------------------------------------------
    |
    | 消息发布列表
    | 所有需发布的消息，都需要在此预定义
    |
     */
    'pub_subjects' => [
        // lanqb_user_register
    ],
];

